sdaiRenameModelBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Renames the model.
\param repository   [in] A repository where the function searches for the model by its name.
\param modelOldName [in] A string that contains the old model name. This name is used to find the model to be renamed.
\param modelName    [in] A string that contains the new model name.